app/controllers/exercises_controller.rb

INSERT INTO "exercises" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "koira ripuloi"], ["created_at", "2015-01-15 14:00:34.156423"], ["updated_at", "2015-01-15 14:00:34.156423"]]
---
  def create
    @exercise = Exercise.new(exercise_params)
    respond_to do |format|
      if @exercise.save

SELECT  "exercises".* FROM "exercises" WHERE "exercises"."id" = ? LIMIT 1  [["id", 1]]
---
  def set_exercise
    @exercise = Exercise.find(params[:id])